; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content))
    )
)

; problem
(define (problem problem_size2)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 - location
	box1 box2 - box
	comida medicina - bcontent
	person1 person2 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio1)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person2 comida)
))
)

; plan
1. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 0 of 2
2. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 0 of 2
3. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 0 of 2
4. (leave box1 refugio1 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box1)
   added: (at-box box1 refugio1) (free dron1-der) (person-has person2 comida)
   goals met: 1 of 2
5. (move refugio1 refugio2 dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 refugio2)
   goals met: 1 of 2
6. (leave box2 refugio2 dron1-izq dron1 person1 medicina)
   deleted: (carrying dron1 dron1-izq box2)
   added: (at-box box2 refugio2) (free dron1-izq) (person-has person1 medicina)
   goals met: 2 of 2
